<a href="https://colab.research.google.com/github/ragalaa/Directory/blob/master/Pandas_Dataframe_basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
!git clone https://github.com/magdapoppins/pandas-basics.git

fatal: destination path 'pandas-basics' already exists and is not an empty directory.

In [12]:
import json
import pandas as pd
import numpy as np

records = [
    ('Math', 'Chemistry', 'Physics'),
    ('Crafts','Art', 'Electronics')]

pd.DataFrame.from_records(records)

        0          1            2
0    Math  Chemistry      Physics
1  Crafts        Art  Electronics

In [26]:
# dataset = pd.read_csv('\pandas-basics\artworkdata.csv')
numpArray = np.random.rand(3)
type(numpArray)

my_series = pd.Series(numpArray,index=["First","second","third"])  ## Labels defined our self.
## Index using Label
# my_series["First"]
my_series.index

Index(['First', 'second', 'third'], dtype='object')

In [28]:
### More columns than one

array_2d = np.random.rand(3,2)
array_2d

array([[0.23073318, 0.61880705],
       [0.00273927, 0.37562751],
       [0.73933144, 0.72875963]])

In [29]:
array_2d[0,1]

0.6188070518728948

In [31]:
## Creating data frame

df = pd.DataFrame(array_2d)
df

          0         1
0  0.230733  0.618807
1  0.002739  0.375628
2  0.739331  0.728760

In [32]:
df.columns =["First","second"]
df

      First    second
0  0.230733  0.618807
1  0.002739  0.375628
2  0.739331  0.728760

In [33]:
df["second"]

0    0.618807
1    0.375628
2    0.728760
Name: second, dtype: float64

# Pandas Data Input capabilities: Reading from JSON with OS

In [41]:

COLS_TO_USE = ['id','artist','title','medium','year','acquisitionYear','height','width','units']
Dataset = pd.read_csv('./pandas-basics/artworkdata.csv',nrows = 5 , 
                      index_col='id', usecols=['id','artist'],low_memory=False)
Dataset.head()

              artist
id
1035   Blake, Robert
1036   Blake, Robert
1037   Blake, Robert
1038   Blake, Robert
1039  Blake, William

In [43]:
Dataset = pd.read_csv('./pandas-basics/artworkdata.csv',nrows = 50 , 
                      index_col='id', usecols=COLS_TO_USE,low_memory=False)
Dataset.head()

              artist  ... units
id                    ...
1035   Blake, Robert  ...    mm
1036   Blake, Robert  ...    mm
1037   Blake, Robert  ...    mm
1038   Blake, Robert  ...    mm
1039  Blake, William  ...    mm

[5 rows x 8 columns]

In [0]:
## Load to disk by serializing the data the python Objects
df.to_pickle("./pandas-basics/dummy.pkl")

In [46]:
### JSON nested Objects
## Traverse folders to get all json files
## Find the way to read them so that pandas understands
### Try to produceidentical DataFrame as  for CSV

records = [("Espresso","5$"),
           ("Flat White", "10$")]
pd.DataFrame.from_records(records)
pd.DataFrame.from_records(records, columns=["coffe","price"])

        coffe price
0    Espresso    5$
1  Flat White   10$

In [0]:
### Reading Json files
# file_path = './pandas-basics/artworkdata.csv'

def get_record_from_file(file_path,COLS_TO_USE):
    """ Process single json file and return a tuple
     containing specific fields."""
    
    with open(file_path) as artwork_file:
        content = json.load(artwork_file)
    
    record = []
    for field in COLS_TO_USE:
        record.append(content[field])
        
    return tuple(record)

In [55]:
### process the files by specifying the path to json file
COLS_TO_USE_JSON = ['id','all_artists','title','medium','acquisitionYear','height','width','units']
file_path = './pandas-basics/artworks/a/000/a00001-1035.json'
sample_record = get_record_from_file(file_path, COLS_TO_USE_JSON)

sample_record

(1035,
 'Robert Blake',
 'A Figure Bowing before a Seated Old Man with his Arm Outstretched in Benediction. Verso: Indecipherable Sketch',
 'Watercolour, ink, chalk and graphite on paper. Verso: graphite on paper',
 1922,
 '419',
 '394',
 'mm')

In [0]:
import os as os

def read_artworks_from_json(COLS_TO_USE_JSON):
    
    """ Traverse the directories with JSON files
       For first file in each directory call fucntion
       for processing single file and goto next directory
    """
    Json_root = './pandas-basics/artworks'
    artworks = []

    for root,_,files in os.walk(Json_root):
    
        for f in files:
            if f.endswith('json'):
                record = get_record_from_file(os.path.join(root,f), 
                                          COLS_TO_USE_JSON)
                artworks.append(record)
#         break
        
    Data = pd.DataFrame.from_records(artworks, 
                               columns= COLS_TO_USE_JSON,
                               index = "id")  
    return Data

In [108]:
### call th function with key fields
df = read_artworks_from_json(COLS_TO_USE_JSON)
df.sample(10)

                         all_artists  ... units
id                                    ...
27814  Joseph Mallord William Turner  ...    mm
7564                    George Jones  ...
7477                    George Jones  ...
1934                  William Callow  ...    mm
27682  Joseph Mallord William Turner  ...    mm
27870  Joseph Mallord William Turner  ...    mm
7297                    George Jones  ...
7286                    George Jones  ...
6724            Arthur Boyd Houghton  ...
7432                    George Jones  ...

[10 rows x 7 columns]

# Indexing and Filtering :

In [114]:
## Data selection as we have to clean input date
""" 
  Question like : Howmany distinct artists are there in the dataset
       How many artworks by Francis Bacon are there
       what is the artwork with the biggest dimension
 """

## column selection in data frameis like
# Dataset[['artist','medium']]

' \n  Question like : Howmany distinct artists are there in the dataset\n       How many artworks by Francis Bacon are there\n       what is the artwork with the biggest dimension\n '

In [117]:
df = pd.read_pickle(os.path.join('./pandas-basics/dummy.pkl'))

<bound method NDFrame.head of       First    second
0  0.230733  0.618807
1  0.002739  0.375628
2  0.739331  0.728760>

In [122]:

### Howmany distinct artists are there in the dataset
Dataset.artist
artists = Dataset['artist']
pd.unique(artists)
len(pd.unique(artists))

3

In [132]:
###  How many artworks by Francis Bacon are there
## Convert to series and then boolean which contains ID and artist value true/false

# S = Dataset['artist'] == 'Blake, William'
# S.value_counts()
# type(S)


### Other way's

artist_count = Dataset['artist'].value_counts()
artist_count['Blake, William']
type(artist_count)

pandas.core.series.Series

In [0]:
### Indexing done the right way
"""
     loc and Iloc to bringall
     LOc by label
     iloc by position
     
    Row labels as Index we set as
    Columnlabel is   0    1
                     1
   selecting by label  df.loc[ "Row Indexer" , "Column Indexer"]  
    Example : df.loc[1035,'artist']
     Also boolean expression df.loc[df['artist']==''Blake, William', :( all columns)]
     
 Selecting by iloc by position
 Example: df.iloc[ row indexer , column indexer
                    100:100     ,  [0,1,4]]
            df.iloc[ row indexer , column indexer
                    :(all rows)     ,  [0,1,4]]        
 
 
"""

In [136]:
####what is the artwork with the biggest dimension

Dataset.loc[1035,'artist']
Dataset.iloc[0,0]
Dataset.iloc[0,:]
Dataset.iloc[0:2,0:2]

'Blake, Robert'

In [0]:
## Try Multiplication
# Dataset['height'] * Dataset['width']
#  Dataset['width'].sort_values().head()
#  Dataset['width'].sort_values().tail()

In [0]:
## Try to convert data object to numeric data types

pd.to_numeric(Dataset['width'])

### Force NAN's
pd.to_numeric(Dataset['width'], errors = 'coerce')
Dataset.loc[:,'width'] = pd.to_numeric(Dataset['width'], errors = 'coerce')

In [146]:
Dataset['units'].value_counts()

mm    50
Name: units, dtype: int64

In [150]:
### create new column with Area

area = Dataset['height'] * Dataset['width']
Dataset = Dataset.assign(area = area)

Dataset.sample(2)

              artist                                     title  ... units   area
id                                                              ...
1064  Blake, William  Every Man also Gave him a Piece of Money  ...    mm  29550
1059  Blake, William      When the Morning Stars Sang Together  ...    mm  28650

[2 rows x 9 columns]

In [155]:
Dataset['area'].max()
Dataset['area'].idxmax()  # Index of Maximum row which will display
Dataset.loc[Dataset['area'].idxmax(),:]

artist                                                Blake, William
title              Preliminary Sketch for â€˜Christ Girding Himself...
medium                   Graphite on paper. Verso: graphite on paper
year                                                            1805
acquisitionYear                                                 1922
width                                                            505
height                                                           425
units                                                             mm
area                                                          214625
Name: 1077, dtype: object